# language: ru

Функция: Работа с документацией  по АPI по сериалу Рик и Морти https://rickandmortyapi.com/documentation/#episode-schema.

  Сценарий: Поиск информации по персонажу Морти Смит, поиск последнего эпизода где появлялся Морти Смит,
  получение из списка последнего эпизода последнего персонажа,
  проверка персонаж той же расы и находится ли он там же где и Морти

    Когда Получаем последний эпизод, где появлялся Морти
    И Находим данные последнего персонажа в последнем эпизоде
    И Получаем данные последнего персонажа из последнего эпизода
    И Получаем местоположение последнего персонажа из последнего эпизода
    И Получаем расу последнего персонажа из последнего эпизода
    И Получаем информацию о местонахождении Морти
    Тогда Получаем информацию о расе Морти